Revit 2027 API
ParameterTypeId.WallOffsetFromHost Property
 "Offset from Host"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId WallOffsetFromHost { get; }
Public Shared ReadOnly Property WallOffsetFromHost As ForgeTypeId
	Get
public:
static property ForgeTypeId^ WallOffsetFromHost {
	ForgeTypeId^ get ();
}
static member WallOffsetFromHost : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace